app/views/events/_event.html.erb

    <p>
      <li><%= User.find(event.attendees.ids).to_s if event.attendees.ids %></li>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]