app/controllers/events_controller.rb

  def index
    params.permit!
    @events = Event.paginate :page => params[:page], :per_page => 4
---
SELECT "events".* FROM "events" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]

  def show
    params.permit!
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]