app/controllers/users_controller.rb

INSERT INTO "users" ("login", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    params.permit!
    @user = User.new(params[:user])


    respond_to do |format|
      if request.post? and @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit

    current_user = User.find_by(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."login" = $1 LIMIT $2  [["login", "ludake"], ["LIMIT", 1]]
---
  def login
    params.permit(:login, :password, :authenticity_token, :remember_me, :commit)
    user = User.find_by(login: params[:login])